jovere/stm32h7doom/App/gfx.c
/*
 * gfx.c
 *
 *  Created on: 24.05.2014
 *      Author: Florian
 */


/*---------------------------------------------------------------------*
 *  include files                                                      *
 *---------------------------------------------------------------------*/

#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include "stm32h7xx.h"
#include "ff.h"
#include "gfx.h"
#include "jpeg.h"
#include "lcd.h"
#include "main.h"

/*---------------------------------------------------------------------*
 *  local definitions                                                  *
 *---------------------------------------------------------------------*/

#define abs(X) (((X) < 0 ) ? -(X) : (X))
#define sgn(X) (((X) < 0 ) ? -1 : 1)

/*---------------------------------------------------------------------*
 *  external declarations                                              *
 *---------------------------------------------------------------------*/

/*---------------------------------------------------------------------*
 *  public data                                                        *
 *---------------------------------------------------------------------*/

gfx_obj_t* gfx_objects[GFX_MAX_OBJECTS];

/*---------------------------------------------------------------------*
 *  private data                                                       *
 *---------------------------------------------------------------------*/

/*---------------------------------------------------------------------*
 *  private functions                                                  *
 *---------------------------------------------------------------------*/

/*
 * Map ISO8859-1 character to font character index
 *
 * @param[in]	chr	Character to map
 * @return		Mapped character
 */
static inline char gfx_map_char (char chr)
{
	switch (chr)
	{
		case 0xE4:
			// ae
			return (char)128;

		case 0xF6:
			// oe
			return (char)129;

		case 0xFC:
			// ue
			return (char)130;

		case 0xC4:
			// AE
			return (char)131;

		case 0xD6:
			// OE
			return (char)132;

		case 0xDC:
			// UE
			return (char)133;

		case 0xDF:
			// ss
			return (char)134;

		case 0xA7:
			// Euro
			return (char)135;

		default:
			return chr;
	}
}

/*
 * Convert pixel format into color mode
 *
 * @param[in]	pixel_format	Pixel format to convert
 * @return		Converted color mode
 */
static uint32_t gfx_convert_colormode (gfx_pixel_format_t pixel_format)
{
	switch (pixel_format)
	{
		case GFX_PIXEL_FORMAT_RGB565:
			return DMA2D_OUTPUT_RGB565;

		case GFX_PIXEL_FORMAT_ARGB8888:
			return DMA2D_OUTPUT_ARGB8888;

		default:
			fatal_error ("unknown pixel format");
			return 0;
	}
}

/*
 * Returns the number of bytes per pixel, depending on the pixel format
 *
 * @param[in]	img	Image
 * @return		Bytes per pixel
 */
static inline uint8_t gfx_bytes_per_pixel (gfx_image_t* img)
{
	switch (img->pixel_format)
	{
		case GFX_PIXEL_FORMAT_RGB565:
			return 2;

		case GFX_PIXEL_FORMAT_ARGB8888:
			return 4;

		default:
			fatal_error ("unknown pixel format");
			return 0;
	}
}

/*
 * Draw a single pixel to an image
 *
 * @param[in]	img		Image to draw onto
 * @param[in]	x		X
 * @param[in]	y		Y
 * @param[in]	color	Color
 */
static inline void gfx_draw_pixel (gfx_image_t* img, uint16_t x, uint16_t y, uint32_t color)
{
	switch (img->pixel_format)
	{
		case GFX_PIXEL_FORMAT_RGB565:
			((uint16_t*)img->pixel_data)[y * img->width + x] = (uint16_t)(color & 0xFFFF);
			break;

		case GFX_PIXEL_FORMAT_ARGB8888:
			((uint32_t*)img->pixel_data)[y * img->width + x] = color;
			break;

		default:
			fatal_error ("unknown pixel format");
	}
}

/*
 * Blend pixel with background (using both alpha channels)
 * The resulting color is the blending of background and foreground color
 * Porter-Duff algorithm
 *
 * @param[in]	img		Image
 * @param[in]	x		X
 * @param[in]	y		Y
 * @param[in]	color	Foreground color (alpha ignored)
 * @param[in]	alpha	Foreground alpha channel value
 */
#if 1
static inline void gfx_blend_pixel (gfx_image_t* img, uint16_t x, uint16_t y, uint32_t color, uint8_t alpha)
{
	uint32_t color_back;

	uint8_t rf;
	uint8_t gf;
	uint8_t bf;

	uint8_t ab;
	uint8_t rb;
	uint8_t gb;
	uint8_t bb;

	uint8_t r;
	uint8_t g;
	uint8_t b;

	uint8_t a_mult;
	uint8_t a_out;

	color_back = gfx_get_pixel (img, x, y);

	switch (img->pixel_format)
	{
		case GFX_PIXEL_FORMAT_RGB565:
			rf = GFX_RGB565_R(color);
			gf = GFX_RGB565_G(color);
			bf = GFX_RGB565_B(color);

			rb = GFX_RGB565_R(color_back);
			gb = GFX_RGB565_G(color_back);
			bb = GFX_RGB565_B(color_back);
			ab = GFX_OPAQUE;
			break;

		case GFX_PIXEL_FORMAT_ARGB8888:
			rf = GFX_ARGB8888_R(color);
			gf = GFX_ARGB8888_G(color);
			bf = GFX_ARGB8888_B(color);

			rb = GFX_ARGB8888_R(color_back);
			gb = GFX_ARGB8888_G(color_back);
			bb = GFX_ARGB8888_B(color_back);
			ab = GFX_ARGB8888_A(color_back);
			break;

		default:
			fatal_error ("unknown pixel format");
			return;
	}

	a_mult = (uint8_t)((uint16_t)(alpha * ab) / 255);
	a_out = alpha + ab - a_mult;

	r = (uint8_t)((uint16_t)((rf * alpha) + (rb * ab) - (rb * a_mult)) / a_out);
	g = (uint8_t)((uint16_t)((gf * alpha) + (gb * ab) - (gb * a_mult)) / a_out);
	b = (uint8_t)((uint16_t)((bf * alpha) + (bb * ab) - (bb * a_mult)) / a_out);

	switch (img->pixel_format)
	{
		case GFX_PIXEL_FORMAT_RGB565:
			color = GFX_RGB565(r, g, b);
			break;

		case GFX_PIXEL_FORMAT_ARGB8888:
			color = GFX_ARGB8888(r, g, b, a_out);
			break;

		default:
			return;
	}

	gfx_draw_pixel (img, x, y, color);
}
#else
/*
 * Blend pixel with background (using only foreground alpha channel)
 * The resulting color is the blending of background and foreground color
 *
 * @param[in]	img		Image
 * @param[in]	x		X
 * @param[in]	y		Y
 * @param[in]	color	Foreground color
 */
static inline void gfx_blend_pixel (gfx_image_t* img, uint16_t x, uint16_t y, uint32_t color)
{
	uint32_t color_back;

	uint8_t mask;
	uint8_t temp;
	uint8_t rf;
	uint8_t rb;
	uint8_t gf;
	uint8_t gb;
	uint8_t bf;
	uint8_t bb;

	color_back = gfx_get_pixel (img, x, y);

	rf = GFX_ARGB8888_R(color);
	gf = GFX_ARGB8888_G(color);
	bf = GFX_ARGB8888_B(color);
	mask = (uint8_t)!GFX_ARGB8888_A(color);

	rb = GFX_ARGB8888_R(color_back);
	gb = GFX_ARGB8888_G(color_back);
	bb = GFX_ARGB8888_B(color_back);

