jovere/stm32h7doom/App/gfx.c
	temp = ((255 - mask) * rf) / 255 + (mask * rb / 255);
	rf = temp & 0xFF;

	temp = ((255 - mask) * gf) / 255 + (mask * gb / 255);
	gf = temp & 0xFF;

	temp = ((255 - mask) * bf) / 255 + (mask * bb / 255);
	bf = temp & 0xFF;

	color = GFX_ARGB8888(rf, gf, bf, GFX_OPAQUE);

	gfx_set_pixel (img, x, y, color);
}
#endif

/*
 * Draw an RGB565 image to the frame buffer
 *
 * @param[in]	img		Image to draw
 * @param[in]	coord	Coordinates
 */
static void gfx_draw_img_rgb565 (gfx_image_t* img, gfx_coord_t* coord)
{
    uint16_t picture_width = img->width;
	uint16_t picture_height = img->height;

	// check for dimensions
	if (coord->source_w == 0) return;
	if (coord->source_h == 0) return;
	if (coord->source_x + coord->source_w > picture_width) return;
	if (coord->source_y + coord->source_h > picture_height) return;
	if (coord->dest_x + coord->source_w > GFX_MAX_WIDTH) return;
	if (coord->dest_y + coord->source_h > GFX_MAX_HEIGHT) return;

	// target address in display RAM
	uint32_t dest_address = lcd_frame_buffer + 2 * (GFX_MAX_WIDTH * coord->dest_y + coord->dest_x);

	// source address in image
	uint32_t offset = 2 * (picture_width * coord->source_y + coord->source_x);
	uint32_t source_address = (uint32_t)&img->pixel_data[offset];

	// Configure DMA2D handle
	hdma2d.Instance = DMA2D;
	hdma2d.Init.Mode = DMA2D_M2M;
	hdma2d.Init.ColorMode = DMA2D_OUTPUT_RGB565;
	hdma2d.Init.OutputOffset = GFX_MAX_WIDTH - coord->source_w;
	hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
	hdma2d.Init.RedBlueSwap = DMA2D_RB_REGULAR;

	if (HAL_DMA2D_Init(&hdma2d) != HAL_OK) {
		fatal_error("DMA2D init failed");
	}

    hdma2d.LayerCfg[0].AlphaInverted = DMA2D_REGULAR_ALPHA;
    hdma2d.LayerCfg[0].InputOffset = 0;
    hdma2d.LayerCfg[0].AlphaMode = DMA2D_NO_MODIF_ALPHA;
    hdma2d.LayerCfg[0].InputColorMode = DMA2D_INPUT_RGB565;
    hdma2d.LayerCfg[0].RedBlueSwap = DMA2D_RB_REGULAR;
    hdma2d.LayerCfg[1].AlphaInverted = DMA2D_REGULAR_ALPHA;
    hdma2d.LayerCfg[1].InputOffset = 0;
    hdma2d.LayerCfg[1].AlphaMode = DMA2D_NO_MODIF_ALPHA;
    hdma2d.LayerCfg[1].InputColorMode = DMA2D_INPUT_RGB565;
    hdma2d.LayerCfg[1].RedBlueSwap = DMA2D_RB_REGULAR;

    HAL_DMA2D_ConfigLayer(&hdma2d, 0);
    HAL_DMA2D_ConfigLayer(&hdma2d, 1);

    SCB_CleanDCache_by_Addr((uint32_t*)source_address, coord->source_w * coord->source_h * 2);
	// Start DMA2D transfer in Memory-to-Memory mode
	if (HAL_DMA2D_Start(&hdma2d, source_address, dest_address, coord->source_w, coord->source_h) != HAL_OK) {
		fatal_error("DMA2D start failed");
	}

	// Wait for transfer completion
	if (HAL_DMA2D_PollForTransfer(&hdma2d, 1000) != HAL_OK) {
		fatal_error("DMA2D transfer failed");
	}
}

/*
 * Draw an ARGB888 image to the frame buffer
 *
 * @param[in]	img		Image to draw
 * @param[in]	coord	Coordinates
 */
static void gfx_draw_img_argb8888 (gfx_image_t* img, gfx_coord_t* coord)
{
	uint32_t dest_address;
	uint32_t source_address;
	uint32_t offset;
	uint16_t picture_width;
	uint16_t picture_height;

	picture_width = img->width;
	picture_height = img->height;

	// check for dimensions
	if (coord->source_w == 0) return;
	if (coord->source_h == 0) return;
	if (coord->source_x + coord->source_w > picture_width) return;
	if (coord->source_y + coord->source_h > picture_height) return;
	if (coord->dest_x + coord->source_w > GFX_MAX_WIDTH) return;
	if (coord->dest_y + coord->source_h > GFX_MAX_HEIGHT) return;

	// target address in display RAM
	dest_address = lcd_frame_buffer + 2 * (GFX_MAX_WIDTH * coord->dest_y + coord->dest_x);

	// source address in image
	offset = 4 * (picture_width * coord->source_y + coord->source_x);
	source_address = (uint32_t)&img->pixel_data[offset];

	// Configure DMA2D handle for blending mode
	hdma2d.Instance = DMA2D;
	hdma2d.Init.Mode = DMA2D_M2M_BLEND;
	hdma2d.Init.ColorMode = DMA2D_OUTPUT_RGB565;
	hdma2d.Init.OutputOffset = GFX_MAX_WIDTH - coord->source_w;
	hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
	hdma2d.Init.RedBlueSwap = DMA2D_RB_REGULAR;

	if (HAL_DMA2D_Init(&hdma2d) != HAL_OK) {
		fatal_error("DMA2D init failed");
	}

	// Configure foreground layer (source image)
	hdma2d.LayerCfg[DMA2D_FOREGROUND_LAYER].InputOffset = picture_width - coord->source_w;
	hdma2d.LayerCfg[DMA2D_FOREGROUND_LAYER].InputColorMode = DMA2D_INPUT_ARGB8888;
	hdma2d.LayerCfg[DMA2D_FOREGROUND_LAYER].AlphaMode = DMA2D_NO_MODIF_ALPHA;
	hdma2d.LayerCfg[DMA2D_FOREGROUND_LAYER].InputAlpha = 0xFF;
	hdma2d.LayerCfg[DMA2D_FOREGROUND_LAYER].RedBlueSwap = DMA2D_RB_REGULAR;
	hdma2d.LayerCfg[DMA2D_FOREGROUND_LAYER].AlphaInverted = DMA2D_REGULAR_ALPHA;

	if (HAL_DMA2D_ConfigLayer(&hdma2d, DMA2D_FOREGROUND_LAYER) != HAL_OK) {
		fatal_error("DMA2D foreground config failed");
	}

	// Configure background layer (destination)
	hdma2d.LayerCfg[DMA2D_BACKGROUND_LAYER].InputOffset = GFX_MAX_WIDTH - coord->source_w;
	hdma2d.LayerCfg[DMA2D_BACKGROUND_LAYER].InputColorMode = DMA2D_INPUT_RGB565;
	hdma2d.LayerCfg[DMA2D_BACKGROUND_LAYER].AlphaMode = DMA2D_NO_MODIF_ALPHA;
	hdma2d.LayerCfg[DMA2D_BACKGROUND_LAYER].InputAlpha = 0xFF;
	hdma2d.LayerCfg[DMA2D_BACKGROUND_LAYER].RedBlueSwap = DMA2D_RB_REGULAR;
	hdma2d.LayerCfg[DMA2D_BACKGROUND_LAYER].AlphaInverted = DMA2D_REGULAR_ALPHA;

	if (HAL_DMA2D_ConfigLayer(&hdma2d, DMA2D_BACKGROUND_LAYER) != HAL_OK) {
		fatal_error("DMA2D background config failed");
	}

	// Start blending transfer
    SCB_CleanDCache_by_Addr((uint32_t*)source_address, coord->source_w * coord->source_h * 4);
	if (HAL_DMA2D_BlendingStart(&hdma2d, source_address, dest_address, dest_address, coord->source_w, coord->source_h) != HAL_OK) {
		fatal_error("DMA2D blending start failed");
	}

	// Wait for transfer completion
	if (HAL_DMA2D_PollForTransfer(&hdma2d, 1000) != HAL_OK) {
		fatal_error("DMA2D transfer failed");
	}
}

/*
 * Get font's character dimensions
 *
 * @param[in]	char	Character
 * @param[in]	font	Font
 * @param[out]	width	Character's width
 * @param[out]	height	Character's height
 */
static void gfx_get_char_dimensions (const char chr, const gfx_font_t* font, uint16_t* width, uint16_t* height)
{
	uint16_t char_offset;

	if (font->bitmap_font)
	{
		/* get the font dimensions */
		*width = font->char_width;
		*height = font->char_height;
	}
	else
	{
		/* get individual character dimensions */
		char_offset = font->offsets[gfx_map_char (chr ) - 32];

		*width = font->chars[char_offset + 1];
		*height = font->chars[char_offset + 2] + font->chars[char_offset + 0]; // height + y_offset
	}
}

