jovere/stm32h7doom/App/gfx.c
/*
 * Measure string's dimensions
 *
 * @param[in]	str			String to measure
 * @param[in]	font		Font
 * @param[in]	word_only	Only measure the first word of the string
 * @param[out]	width		String's width
 * @param[out]	height		String's height
 * @return		Number of characters in the measured string
 */
static uint16_t gfx_measure_string (const char* str, const gfx_font_t* font, bool word_only, uint16_t* width, uint16_t* height)
{
	uint16_t chars;
	uint16_t char_width;
	uint16_t char_height;

	*width = 0;
	*height = 0;

	chars = 0;

	while ((str[chars] != '\0') && (str[chars] != '\n'))
	{
		if (word_only && (str[chars] == ' '))
		{
			break;
		}

		gfx_get_char_dimensions (str[chars], font, &char_width, &char_height);

		*width += (char_width + font->char_space);

		if (char_height > *height)
		{
			*height = char_height;
		}

		chars++;
	}

	// remove last distance
	*width -= font->char_space;

	return chars;
}

/*---------------------------------------------------------------------*
 *  public functions                                                   *
 *---------------------------------------------------------------------*/

/*
 * Initialize and fill the screen white
 */
void gfx_init (void)
{
	gfx_clear_screen (0);
    lcd_refresh();
    gfx_clear_screen (0);
    lcd_refresh();
}

/*
 * Add graphics object to collection of graphical objects
 *
 * @param[in]	obj	Graphics object
 * @return		True on success, otherwise false
 */
bool gfx_add_object (gfx_obj_t* obj)
{
	uint8_t i;

	for (i = 0; i < GFX_MAX_OBJECTS; i++)
	{
		if (gfx_objects[i] == NULL)
		{
			gfx_objects[i] = obj;
			return true;
		}
	}

	return false;
}

/*
 * Delete a graphics object
 * This does not free its memory
 *
 * @param[in]	obj	Graphics object
 * True on success, otherwise false
 */
bool gfx_delete_object (gfx_obj_t* obj)
{
	uint8_t i;

	for (i = 0; i < GFX_MAX_OBJECTS; i++)
	{
		if (gfx_objects[i] == obj)
		{
			gfx_objects[i] = NULL;
			return true;
		}
	}

	return false;
}

/*
 * Delete all graphical objects
 * This does not free their memory
 */
void gfx_delete_objects (void)
{
	uint8_t i;

	for (i = 0; i < GFX_MAX_OBJECTS; i++)
	{
		gfx_objects[i] = NULL;
	}
}

/*
 * Draw all graphical objects
 */
void gfx_draw_objects (void)
{
	uint8_t i;

	for (i = 0; i < GFX_MAX_OBJECTS; i++)
	{
		if ((gfx_objects[i] != NULL) && gfx_objects[i]->enabled)
		{
			switch (gfx_objects[i]->obj_type)
			{
				case GFX_OBJ_IMG:
					gfx_draw_img ((gfx_image_t*)gfx_objects[i]->data, &gfx_objects[i]->coords);
					break;

				default:
					break;
			}
		}
	}
}

/*
 * Refresh display
 * This swaps the frame buffers
 */
void gfx_refresh (void)
{
	lcd_refresh ();
}

/*
 * Clear the whole screen with selected color
 *
 * @param[in]	color	Color
 */
void gfx_clear_screen (uint16_t color)
{
	// Configure DMA2D handle for Register-to-Memory mode (clear screen)
	hdma2d.Instance = DMA2D;
	hdma2d.Init.Mode = DMA2D_R2M;
	hdma2d.Init.ColorMode = DMA2D_OUTPUT_RGB565;
	hdma2d.Init.OutputOffset = 0;
	hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
	hdma2d.Init.RedBlueSwap = DMA2D_RB_REGULAR;

	if (HAL_DMA2D_Init(&hdma2d) != HAL_OK) {
		fatal_error("DMA2D init failed");
	}

	// Extract color components and create fill color
	uint8_t r = GFX_RGB565_R(color);
	uint8_t g = GFX_RGB565_G(color);
	uint8_t b = GFX_RGB565_B(color);
	uint32_t fill_color = (0xFF << 24) | (r << 16) | (g << 8) | b;

	// Start fill operation for entire screen
	if (HAL_DMA2D_Start(&hdma2d, fill_color, lcd_frame_buffer, GFX_MAX_WIDTH, GFX_MAX_HEIGHT) != HAL_OK) {
		fatal_error("DMA2D clear screen start failed");
	}

	// Wait for transfer completion
	if (HAL_DMA2D_PollForTransfer(&hdma2d, 1000) != HAL_OK) {
		fatal_error("DMA2D transfer failed");
	}
}

/*
 * Draw image to screen
 *
 * @param[in]	img		Image
 * @param[in]	coord	Coordinates
 */
void gfx_draw_img (gfx_image_t* img, gfx_coord_t* coord)
{
	switch (img->pixel_format)
	{
		case GFX_PIXEL_FORMAT_RGB565:
			gfx_draw_img_rgb565 (img, coord);
			break;

		case GFX_PIXEL_FORMAT_ARGB8888:
			gfx_draw_img_argb8888 (img, coord);
			break;

		default:
			break;
	}
}

/*
 * Load image from file
 *
 * @param[in]	file_name	File path and name
 * @param[out]	img			Image
 * @return		True on success, otherwise false
 */
bool gfx_load_img (const char* file_name, gfx_image_t* img)
{
	FIL file;
	FRESULT fres;
	uint32_t file_size;
	uint8_t* data;
	UINT read;
	uint16_t tmp;
	uint32_t i;
	bool jpeg;

	if (f_open (&file, file_name, FA_OPEN_EXISTING | FA_READ) == FR_OK)
	{
		file_size = f_size (&file);

		// read first two bytes to detect file type
		fres = f_read (&file, (uint8_t*)&tmp, 2, &read);

		if (fres != FR_OK)
		{
			printf ("could not read from file %s\n", file_name);
			f_close (&file);
			return false;
		}

		if (tmp == 0xD8FF)
		{
			// JPEG
			jpeg = true;

			// rewind file pointer to read file from the beginning
			f_lseek (&file, 0);

			img->pixel_format = GFX_PIXEL_FORMAT_RGB565;

			data = (uint8_t*)malloc (file_size);

			fres = f_read (&file, data, file_size, &read);
		}
		else
		{
			// image
			jpeg = false;

			// first two bytes were already read as width
			img->width = tmp;

			// read height
			fres = f_read (&file, (uint8_t*)&tmp, 2, &read);
			img->height = tmp;

			// read pixel format
			fres = f_read (&file, (uint8_t*)&tmp, 2, &read);
			img->pixel_format = tmp;

			// dummy read next two bytes
			fres = f_read (&file, (uint8_t*)&tmp, 2, &read);

			data = (uint8_t*)malloc (file_size - 8);

			fres = f_read (&file, data, file_size - 8, &read);
		}

		f_close (&file);
	}
	else
	{
		printf ("could not open file %s\n", file_name);
		return false;
	}

	if (jpeg)
	{
		// decode JPEG
		uint8_t* decoded;

		// find width and height
		for (i = 0; i < file_size; i++)
		{
			if ((data[i] == 0xFF) && (data[i + 1] == 0xC0))
			{
				img->width = (data[i + 7] << 8) | (data[i + 8]);
				img->height = (data[i + 5] << 8) | (data[i + 6]);

				break;
			}
		}

		decoded = (uint8_t*)malloc (img->width * img->height * 2);
		jpeg_decode (data, decoded, 0, 0);

		free (data);

		img->pixel_data = decoded;
	}
	else
	{
		img->pixel_data = data;
	}

