jovere/stm32h7doom/App/gfx.c
	return true;
}

/*
 * Clean up memory used by an image
 *
 * @param[in]	img	Image
 */
void gfx_unload_img (gfx_image_t* img)
{
	free (img->pixel_data);
	img->pixel_data = NULL;
}

/*
 * Draw a single character to an image
 *
 * @param[in]	chr		Character to draw
 * @param[in]	img		Image to draw onto
 * @param[in]	x0		X
 * @param[in]	y0		Y
 * @param[in]	font	Font
 * @param[in]	color	Color
 * @return		Character's width
 */
uint8_t gfx_draw_character (char chr, gfx_image_t* img, uint16_t x0, uint16_t y0, const gfx_font_t* font, uint32_t color)
{
	uint16_t x, y;
	uint8_t cols;
	uint8_t rows;
	uint8_t mask;
	uint8_t pixel_row;
	uint16_t char_offset;
	uint8_t y_offset;
	bool first_nibble = true;
	uint16_t index;

	chr = gfx_map_char (chr);

	if (chr < 0x20)
	{
		return 0;
	}

	if (font->bitmap_font)
	{
		/* get the font dimensions */
		cols = font->char_width;
		rows = font->char_height;

		for (y = 0; y < rows; y++)
		{
			/* get pixel row */
			pixel_row = font->chars[rows * (chr - 32) + y];
			mask = 0x80;

			for (x = 0; x < cols; x++)
			{
				if ((pixel_row & mask) != 0)
				{
					/* character pixel */
					gfx_draw_pixel (img, x0 + y * img->width + x, y0, color);
				}

				mask = mask >> 1;
			}
		}
	}
	else
	{
		index = 3;
		char_offset = font->offsets[chr - 32];

		y_offset = font->chars[char_offset + 0];
		cols = font->chars[char_offset + 1];
		rows = font->chars[char_offset + 2];

		for (x = 0; x < cols; x++)
		{
			for (y = 0; y < rows; y++)
			{
				// extract 4 bit defining the transparency (0xF: transparent, 0x0: opaque)
				if (first_nibble)
				{
					mask = (font->chars[char_offset + index] & 0xF0) << 0;
				}
				else
				{
					mask = (font->chars[char_offset + index] & 0x0F) << 4;
					index++;
				}

				if (mask != 0xF0)
				{
					if (mask != 0x00)
					{
						// semi-transparent color
						gfx_blend_pixel (img, x0 + y * img->width + x, y0 + y_offset, color, (uint8_t)~mask);
					}
					else
					{
						// solid color
						gfx_draw_pixel (img, x0 + y * img->width + x, y0 + y_offset, color);
					}
				}

				first_nibble = !first_nibble;
			}
		}
	}

	return cols;
}

/*
 * Draw character centered
 *
 * @param[in]	chr		Character to draw
 * @param[in]	img		Image to draw onto
 * @param[in]	font	Font
 * @param[in]	coords	Coordinates
 * @param[in]	color	Color
 */
void gfx_draw_character_centered (const char chr, gfx_image_t* img, const gfx_font_t* font, gfx_coord_t* coords, uint32_t color)
{
	uint16_t char_width;
	uint16_t char_height;

	gfx_get_char_dimensions(chr, font, &char_width, &char_height);

	gfx_draw_character (chr, img, coords->dest_x + ((coords->source_w - char_width) / 2), coords->dest_y, font, color);
}

/*
 * Draw string and break line after character
 *
 * @param[in]	str			String to draw
 * @param[in]	font		Font
 * @param[in]	img			Image to draw onto
 * @param[in]	x			X
 * @param[in]	y			Y
 * @param[in]	max_width	Maximum width of font rectangle. 0 = ignore
 * @param[in]	color		Color
 */
void gfx_draw_string (const char* str, const gfx_font_t* font, gfx_image_t* img, uint16_t x, uint16_t y, uint16_t max_width, uint32_t color)
{
	uint16_t str_index;
	uint16_t char_width;
	uint16_t char_height;
	uint16_t cur_x;
	uint16_t cur_y;

	str_index = 0;
	cur_x = x;
	cur_y = y;

	while (str[str_index] != '\0')
	{
		/* get word dimensions and length */
		gfx_get_char_dimensions (str[str_index], font, &char_width, &char_height);

		if ((cur_x + char_width > img->width) || ((max_width != 0) && (cur_x + char_width > max_width)))
		{
			/* char does not fit in line, start new line */
			cur_x = x;
			cur_y += font->char_height + font->line_space;
		}

		if (str[str_index] == '\n')
		{
			cur_x = x;
			cur_y += font->char_height + font->line_space;
		}
		else if (str[str_index] == '\r')
		{
			/* ignore */
		}
		else
		{
			if (cur_y + char_height > img->height)
			{
				printf ("text too high: %s. max. height = %d, calculated = %d\n", str, img->height, cur_y + char_height);
				return;
			}

			cur_x += gfx_draw_character (str[str_index], img, cur_x, cur_y, font, color) + font->char_space;
		}

		str_index++;
	}
}

/*
 * Draw string and break line after word
 *
 * @param[in]	str			String to draw
 * @param[in]	font		Font
 * @param[in]	img			Image to draw onto
 * @param[in]	x			X
 * @param[in]	y			Y
 * @param[in]	max_width	Maximum width of font rectangle. 0 = ignore
 * @param[in]	color		Color
 */
void gfx_draw_string_wrapped (const char* str, const gfx_font_t* font, gfx_image_t* img, uint16_t x, uint16_t y, uint16_t max_width, uint32_t color)
{
	uint16_t str_index;
	uint16_t word_length;
	uint16_t word_width;
	uint16_t word_height;
	uint16_t i;
	uint16_t cur_x;
	uint16_t cur_y;

	str_index = 0;
	cur_x = x;
	cur_y = y;

	while (str[str_index] != '\0')
	{
		if (str[str_index] == '\n')
		{
			/* new line */
			cur_x = x;
			cur_y += font->char_height + font->line_space;
			str_index++;
			continue;
		}

		/* get word dimensions and length */
		word_length = gfx_measure_string (&str[str_index], font, true, &word_width, &word_height);

		if ((cur_x + word_width > img->width) || ((max_width != 0) && (cur_x + word_width > max_width)))
		{
			/* word does not fit in line, start new line */
			cur_x = x;
			cur_y += font->char_height + font->line_space;
		}

		if (cur_y + word_height > img->height)
		{
			printf ("text too high: %s. max. height = %d, calculated = %d\n", str, img->height, cur_y + word_height);
			return;
		}

		for (i = 0; i < word_length; i++)
		{
			cur_x += gfx_draw_character (str[str_index + i], img, cur_x, cur_y, font, color) + font->char_space;
		}

		str_index += word_length;

		if (str[str_index] == ' ')
		{
			cur_x += gfx_draw_character (' ', img, cur_x, cur_y, font, color) + font->char_space;
			str_index++;
		}
	}
}

/*
 * Draw string vertically centered on image
 *
 * @param[in]	str		String to draw
 * @param[in]	font	Font
 * @param[in]	img		Image to draw onto
 * @param[in]	y		Y
 * @param[in]	color	Color
 */
void gfx_draw_string_centered (const char* str, const gfx_font_t* font, gfx_image_t* img, uint16_t y, uint32_t color)
{
	uint16_t str_width;
	uint16_t str_height;

	gfx_measure_string (str, font, false, &str_width, &str_height);
	gfx_draw_string_wrapped (str, font, img, (img->width - str_width) / 2, y, 0, color);
}

#if 1
/*
 * Rotate image using integer arithmetic
 *
 * @param[in]	src			Source image
 * @param[in]	dst			Destination image
 * @param[in]	radians		Rotation in radians
 * @param[in]	back_color	Background color for areas not covered by source image
 */
void gfx_rotate (gfx_image_t* src, gfx_image_t* dst, float radians, uint32_t back_color)
{
	int16_t x;
	int16_t y;
	int16_t src_x;
	int16_t src_y;
	int16_t src_width;
	int16_t src_height;
	int16_t dst_width;
	int16_t dst_height;
	int16_t src_center_x;
	int16_t src_center_y;
	int16_t dst_center_x;
	int16_t dst_center_y;
	int16_t cosine;
	int16_t sine;

