jovere/stm32h7doom/App/gfx.c
	cosine = (int16_t)(cos (radians) * 1000.0);
	sine = (int16_t)(sin (radians) * 1000.0);

	src_width = src->width;
	src_height = src->height;

	dst_width = dst->width;
	dst_height = dst->height;

	src_center_x = src_width / 2;
	src_center_y = src_height / 2;

	dst_center_x = dst_width / 2;
	dst_center_y = dst_height / 2;

	for (y = 0; y < dst_height; y++)
	{
		for (x = 0; x < dst_width; x++)
		{
			src_x = (int16_t)((((x - dst_center_x) * cosine) + ((y - dst_center_y) * sine)) / 1000) + src_center_x;
			src_y = (int16_t)((((y - dst_center_y) * cosine) - ((x - dst_center_x) * sine)) / 1000) + src_center_y;

			if ((src_x > 0) && (src_x < src_width) && (src_y > 0) && (src_y < src_height))
			{
				((uint32_t*)dst->pixel_data)[y * dst_width + x] = ((uint32_t*)src->pixel_data)[src_y * src_width + src_x];
			}
			else
			{
				((uint32_t*)dst->pixel_data)[y * dst_width + x] = back_color;
			}
		}
	}
}
#else
/*
 * Rotate image using float arithmetic
 *
 * @param[in]	src			Source image
 * @param[in]	dst			Destination image
 * @param[in]	radians		Rotation in radians
 * @param[in]	back_color	Background color for areas not covered by source image
 */
void gfx_rotate (gfx_image_t* src, gfx_image_t* dst, float radians, uint32_t back_color)
{
	int16_t x;
	int16_t y;
	int16_t src_x;
	int16_t src_y;
	int16_t src_width;
	int16_t src_height;
	int16_t dst_width;
	int16_t dst_height;
	int16_t src_center_x;
	int16_t src_center_y;
	int16_t dst_center_x;
	int16_t dst_center_y;
	float cosine;
	float sine;

	cosine = (float)cos (radians);
	sine = (float)sin (radians);

	src_width = src->width;
	src_height = src->height;
	
	dst_width = dst->width;
	dst_height = dst->height;
	
	src_center_x = src_width / 2;
	src_center_y = src_height / 2;
	
	dst_center_x = dst_width / 2;
	dst_center_y = dst_height / 2;

	for (y = 0; y < dst_height; y++)
	{
		for (x = 0; x < dst_width; x++)
		{
			src_x = (int16_t)((x - dst_center_x) * cosine + (y - dst_center_y) * sine) + src_center_x;
			src_y = (int16_t)((y - dst_center_y) * cosine - (x - dst_center_x) * sine) + src_center_y;

			if ((src_x > 0) && (src_x < src_width) && (src_y > 0) && (src_y < src_height))
			{
				((uint32_t*)dst->pixel_data)[y * dst_width + x] = ((uint32_t*)src->pixel_data)[src_y * src_width + src_x];
			}
			else
			{
				((uint32_t*)dst->pixel_data)[y * dst_width + x] = back_color;
			}
		}
	}
}
#endif

/*
 * Flip an image by 90 degrees clockwise.
 * The object's and image's width and height are adjusted as well.
 *
 * @param[in]	obj		Image object to flip
 */
void gfx_flip90 (gfx_obj_t* obj)
{
	uint32_t* tmp;
	uint16_t size_tmp;
	uint16_t x;
	uint16_t y;
	uint32_t size;
	uint16_t src_width;
	uint16_t src_height;
	gfx_image_t* img_src;

	img_src = (gfx_image_t*)obj->data;

	src_width = img_src->width;
	src_height = img_src->height;
	size = src_width * src_height * gfx_bytes_per_pixel (img_src);

	tmp = (uint32_t*)malloc (size);

	for (y = 0; y < src_height; y++)
	{
		for (x = 0; x < src_width; x++)
		{
			tmp[x * src_height + (src_height - y - 1)] = ((uint32_t*)img_src->pixel_data)[y * src_width + x];
		}
	}

	memcpy (img_src->pixel_data, tmp, size);

	free (tmp);

	size_tmp = img_src->width;
	img_src->width = img_src->height;
	img_src->height = size_tmp;

	obj->coords.source_w = img_src->width;
	obj->coords.source_h = img_src->height;
}

/*
 * Copy image from source to destination
 * Destination memory is allocated here
 *
 * @param[in]	source	Source image
 * @param[in]	dest	Destination image
 */
void gfx_copy_image (gfx_image_t* source, gfx_image_t* dest)
{
	uint32_t size;

	size = source->width * source->height * gfx_bytes_per_pixel (source);

	if (dest->pixel_data != NULL)
	{
		free (dest->pixel_data);
	}

	dest->pixel_data = malloc (size);

	memcpy (dest->pixel_data, source->pixel_data, size);
	dest->width = source->width;
	dest->height = source->height;
	dest->pixel_format = source->pixel_format;
}

/*
 * Draw a single pixel to an image
 *
 * @param[in]	img		Image to draw onto
 * @param[in]	x		X
 * @param[in]	y		Y
 * @param[in]	color	Color
 */
void gfx_set_pixel (gfx_image_t* img, uint16_t x, uint16_t y, uint32_t color)
{
	gfx_draw_pixel (img, x, y, color);
}

/*
 * Get the color of a single pixel
 *
 * @param[in]	img		Image
 * @param[in]	x		X
 * @param[in]	y		Y
 * @return		Pixel color
 */
uint32_t gfx_get_pixel (gfx_image_t* img, uint16_t x, uint16_t y)
{
	uint32_t color;

	switch (img->pixel_format)
	{
		case GFX_PIXEL_FORMAT_RGB565:
			color = ((uint16_t*)img->pixel_data)[y * img->width + x];
			break;

		case GFX_PIXEL_FORMAT_ARGB8888:
			color = ((uint32_t*)img->pixel_data)[y * img->width + x];
			break;

		default:
			fatal_error ("unknown pixel format");
	}

	return color;
}

/*
 * Draw a line
 *
 * @param[in]	img		Image to draw onto
 * @param[in]	x1		X start
 * @param[in]	y1		Y start
 * @param[in]	x2		X end
 * @param[in]	y2		Y end
 * @param[in]	color	Color
 */
void gfx_draw_line (gfx_image_t* img, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint32_t color)
{
	uint16_t i;
    uint16_t dx,    dy;
    uint16_t dxabs, dyabs;
    uint16_t sdx,   sdy;
    uint16_t x,     y;
    uint16_t px,    py;

    if (y1 > y2)
	{
		/* we assume y2 > y1 and invert if not */
		i = y2;
		y2 = y1;
		y1 = i;
	}

    if (x1 > x2)
    {
    	/* we assume x2 > x1 and we swap them if not */
        i = x2;
        x2 = x1;
        x1 = i;
    }

    /* the horizontal distance of the line */
    dx = x2 - x1;

    if (dx == 0)
    {
    	/* vertical line */
        gfx_fill_rect (img, x1, y1, 1, y2 - y1 + 1, color);
        return;
    }

    /* the vertical distance of the line */
    dy = y2 - y1;

    if (dy == 0)
    {
    	/* horizontal line */
        gfx_fill_rect (img, x1, y1, x2 - x1 + 1, 1, color);
        return;
    }

    dxabs = abs(dx);
    dyabs = abs(dy);
    sdx = sgn(dx);
    sdy = sgn(dy);
    x = dyabs >> 1;
    y = dxabs >> 1;
    px = x1;
    py = y1;

    /* start pixel */
    gfx_draw_pixel (img, x1, y1, color);

    if (dxabs >= dyabs)
    {
    	/* the line is more horizontal than vertical */
        for (i = 0; i < dxabs; i++)
        {
            y += dyabs;

            if (y >= dxabs)
            {
                y -= dxabs;
                py += sdy;
            }

