jovere/stm32h7doom/App/gfx.c
            px += sdx;

            gfx_draw_pixel (img, px, py, color);
        }
    }
    else
    {
    	/* the line is more vertical than horizontal */
        for (i = 0; i < dyabs; i++)
        {
            x += dxabs;

            if (x >= dyabs)
            {
                x -= dyabs;
                px += sdx;
            }

            py += sdy;

            gfx_draw_pixel (img, px, py, color);
        }
    }
}

/*
 * Fill rectangle with color (hardware accelerated)
 *
 * @param[in]	img		Image to draw onto
 * @param[in]	x		X
 * @param[in]	y		Y
 * @param[in]	width	Width
 * @param[in]	height	Height
 * @param[in]	color	Color
 */
void gfx_fill_rect (gfx_image_t* img, uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint32_t color)
{
	uint8_t r;
	uint8_t g;
	uint8_t b;
	uint8_t a;
	uint32_t offset;
	uint32_t address;

	if (x + width > img->width) return;
	if (y + height > img->height) return;

	switch (img->pixel_format)
	{
		case GFX_PIXEL_FORMAT_RGB565:
			r = GFX_RGB565_R(color);
			g = GFX_RGB565_G(color);
			b = GFX_RGB565_B(color);
			a = GFX_OPAQUE;
			break;

		case GFX_PIXEL_FORMAT_ARGB8888:
			r = GFX_ARGB8888_R(color);
			g = GFX_ARGB8888_G(color);
			b = GFX_ARGB8888_B(color);
			a = GFX_ARGB8888_A(color);
			break;

		default:
			fatal_error ("unknown pixel format");
			return;
	}

	offset = gfx_bytes_per_pixel (img) * (img->width * y + x);
	address = (uint32_t)&img->pixel_data[offset];

	// Configure DMA2D handle for Register-to-Memory mode (fill)
	hdma2d.Instance = DMA2D;
	hdma2d.Init.Mode = DMA2D_R2M;
	hdma2d.Init.ColorMode = gfx_convert_colormode(img->pixel_format);
	hdma2d.Init.OutputOffset = img->width - width;
	hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
	hdma2d.Init.RedBlueSwap = DMA2D_RB_REGULAR;

	if (HAL_DMA2D_Init(&hdma2d) != HAL_OK) {
		fatal_error("DMA2D init failed");
	}

	// Start fill operation
	uint32_t fill_color = (a << 24) | (r << 16) | (g << 8) | b;
	if (HAL_DMA2D_Start(&hdma2d, fill_color, address, width, height) != HAL_OK) {
		fatal_error("DMA2D fill start failed");
	}

	// Wait for transfer completion
	if (HAL_DMA2D_PollForTransfer(&hdma2d, 1000) != HAL_OK) {
		fatal_error("DMA2D transfer failed");
	}
}

/*
 * Draw image onto another image (hardware accelerated)
 *
 * @param[in]	img_src		Source image
 * @param[in]	img_dst		Destination image
 * @param[in]	coord		Coordinates
 */
void gfx_draw_img_on_img (gfx_image_t* img_src, gfx_image_t* img_dst, gfx_coord_t* coord)
{
	uint32_t address_src;
	uint32_t address_dst;
	uint32_t offset;
	uint16_t width_src;
	uint16_t width_dst;
	uint32_t src_color_mode, dst_color_mode;

	width_src = img_src->width;
	width_dst = img_dst->width;

	// check for dimensions
	if (coord->source_w == 0) return;
	if (coord->source_h == 0) return;
	if (coord->source_x + coord->source_w > width_src) return;
	if (coord->source_y + coord->source_h > img_src->height) return;
	if (coord->dest_x + coord->source_w > width_dst) return;
	if (coord->dest_y + coord->source_h > img_dst->height) return;

	// address in source image
	offset = gfx_bytes_per_pixel (img_src) * (width_src * coord->source_y + coord->source_x);
	address_src = (uint32_t)&img_src->pixel_data[offset];

	// address in destination image
	offset = gfx_bytes_per_pixel (img_dst) * (width_dst * coord->dest_y + coord->dest_x);
	address_dst = (uint32_t)&img_dst->pixel_data[offset];

	// Convert output color modes to input color modes
	src_color_mode = (img_src->pixel_format == GFX_PIXEL_FORMAT_RGB565) ? DMA2D_INPUT_RGB565 : DMA2D_INPUT_ARGB8888;
	dst_color_mode = (img_dst->pixel_format == GFX_PIXEL_FORMAT_RGB565) ? DMA2D_INPUT_RGB565 : DMA2D_INPUT_ARGB8888;

	// Configure DMA2D handle for blending mode
	hdma2d.Instance = DMA2D;
	hdma2d.Init.Mode = DMA2D_M2M_BLEND;
	hdma2d.Init.ColorMode = gfx_convert_colormode(img_dst->pixel_format);
	hdma2d.Init.OutputOffset = width_dst - coord->source_w;
	hdma2d.Init.AlphaInverted = DMA2D_REGULAR_ALPHA;
	hdma2d.Init.RedBlueSwap = DMA2D_RB_REGULAR;

	if (HAL_DMA2D_Init(&hdma2d) != HAL_OK) {
		fatal_error("DMA2D init failed");
	}

	// Configure foreground layer (source image)
	hdma2d.LayerCfg[DMA2D_FOREGROUND_LAYER].InputOffset = width_src - coord->source_w;
	hdma2d.LayerCfg[DMA2D_FOREGROUND_LAYER].InputColorMode = src_color_mode;
	hdma2d.LayerCfg[DMA2D_FOREGROUND_LAYER].AlphaMode = DMA2D_NO_MODIF_ALPHA;
	hdma2d.LayerCfg[DMA2D_FOREGROUND_LAYER].InputAlpha = 0xFF;
	hdma2d.LayerCfg[DMA2D_FOREGROUND_LAYER].RedBlueSwap = DMA2D_RB_REGULAR;
	hdma2d.LayerCfg[DMA2D_FOREGROUND_LAYER].AlphaInverted = DMA2D_REGULAR_ALPHA;

	if (HAL_DMA2D_ConfigLayer(&hdma2d, DMA2D_FOREGROUND_LAYER) != HAL_OK) {
		fatal_error("DMA2D foreground config failed");
	}

	// Configure background layer (destination image)
	hdma2d.LayerCfg[DMA2D_BACKGROUND_LAYER].InputOffset = width_dst - coord->source_w;
	hdma2d.LayerCfg[DMA2D_BACKGROUND_LAYER].InputColorMode = dst_color_mode;
	hdma2d.LayerCfg[DMA2D_BACKGROUND_LAYER].AlphaMode = DMA2D_NO_MODIF_ALPHA;
	hdma2d.LayerCfg[DMA2D_BACKGROUND_LAYER].InputAlpha = 0xFF;
	hdma2d.LayerCfg[DMA2D_BACKGROUND_LAYER].RedBlueSwap = DMA2D_RB_REGULAR;
	hdma2d.LayerCfg[DMA2D_BACKGROUND_LAYER].AlphaInverted = DMA2D_REGULAR_ALPHA;

	if (HAL_DMA2D_ConfigLayer(&hdma2d, DMA2D_BACKGROUND_LAYER) != HAL_OK) {
		fatal_error("DMA2D background config failed");
	}

	// Start blending transfer
	if (HAL_DMA2D_BlendingStart(&hdma2d, address_src, address_dst, address_dst, coord->source_w, coord->source_h) != HAL_OK) {
		fatal_error("DMA2D blending start failed");
	}

	// Wait for transfer completion
	if (HAL_DMA2D_PollForTransfer(&hdma2d, 1000) != HAL_OK) {
		fatal_error("DMA2D transfer failed");
	}
}

/*
 * Fill image with color (hardware accelerated)
 *
 * @param[in]	img		Image
 * @param[in]	color	Color
 */
void gfx_fill_img (gfx_image_t* img, uint32_t color)
{
	gfx_fill_rect (img, 0, 0, img->width, img->height, color);
}

/*
 * Initialize image dimensions, pixel format and allocate its memory
 *
 * @param[in]	img				Image to initialize
 * @param[in]	width			Width
 * @param[in]	height			Height
 * @param[in]	pixel_format	Pixel format
 * @param[in]	color			Color to fill image with
 */
void gfx_init_img (gfx_image_t* img, uint16_t width, uint16_t height, gfx_pixel_format_t pixel_format, uint32_t color)
{
	img->width = width;
	img->height = height;
	img->pixel_format = pixel_format;
	img->pixel_data = malloc (width * height * gfx_bytes_per_pixel (img));

	gfx_fill_img (img, color);
}

/*
 * Initialize object with image
 *
 * @param[in]	obj	Object to initialize
 * @param[in]	img	Image to apply to object
 */
void gfx_init_img_obj (gfx_obj_t* obj, gfx_image_t* img)
{
	obj->coords.dest_x = 0;
	obj->coords.dest_y = 0;
	obj->coords.source_w = img->width;
	obj->coords.source_h = img->height;
	obj->coords.source_x = 0;
	obj->coords.source_y = 0;
	obj->obj_type = GFX_OBJ_IMG;
	obj->data = img;
	obj->enabled = true;
}

/*
 * Initialize coordinates with image's dimensions
 *
 * @param[in]	coord	Coordinates to initialize
 * @param[in]	img		Image to use for dimensions
 */
void gfx_init_img_coord (gfx_coord_t* coord, gfx_image_t* img)
{
	coord->dest_x = 0;
	coord->dest_y = 0;
	coord->source_w = img->width;
	coord->source_h = img->height;
	coord->source_x = 0;
	coord->source_y = 0;
}

/*---------------------------------------------------------------------*
 *  eof                                                                *
 *---------------------------------------------------------------------*/
